# SQL playground

Notebook to play with advanced SQL queries. Topics include:
- String manipulation
- Variables
- Aggregate function
- Case statements
- Pivot tables
- Subqueries (correlated and non-correlated)
- Windows
- Views
- Profiling
- Functions and stored procedures

## Load database

In [11]:
%%sql

select * from trades limit 10;

 * mysql://trades:***@localhost/trades
   sqlite:///data/chinook.db
10 rows affected.

[(1, 1, datetime.date(2015, 1, 2), 1420189200018000000, 46.5, 100),
 (2, 1, datetime.date(2015, 1, 2), 1420200325140000000, 46.72, 100),
 (3, 1, datetime.date(2015, 1, 2), 1420200325140000000, 46.72, 100),
 (4, 1, datetime.date(2015, 1, 2), 1420200325142000000, 46.72, 17),
 (5, 1, datetime.date(2015, 1, 2), 1420201783849000000, 46.7, 100),
 (6, 1, datetime.date(2015, 1, 2), 1420203600056000000, 46.45, 24100),
 (7, 1, datetime.date(2015, 1, 2), 1420203600918000000, 46.7, 100),
 (8, 1, datetime.date(2015, 1, 2), 1420203601164000000, 46.68, 100),
 (9, 1, datetime.date(2015, 1, 2), 1420204959344000000, 46.67, 200),
 (10, 1, datetime.date(2015, 1, 2), 1420205356295000000, 46.67, 200)]

In [1]:
%load_ext sql
%sql mysql://chinook:password@localhost/chinook

![](data/chinook_diagram.png)

## String manipulation

In [9]:
%%sql

SELECT address
FROM customer

 * sqlite:///data/chinook.db
Done.

[('Av. Brigadeiro Faria Lima, 2170',),
 ('Theodor-Heuss-Straße 34',),
 ('1498 rue Bélanger',),
 ('Ullevålsveien 14',),
 ('Klanova 9/506',),
 ('Rilská 3174/6',),
 ('Rotenturmstraße 4, 1010 Innere Stadt',),
 ('Grétrystraat 63',),
 ('Sønder Boulevard 51',),
 ('Rua Dr. Falcão Filho, 155',),
 ('Av. Paulista, 2022',),
 ('Praça Pio X, 119',),
 ('Qe 7 Bloco G',),
 ('8210 111 ST NW',),
 ('700 W Pender Street',),
 ('1600 Amphitheatre Parkway',),
 ('1 Microsoft Way',),
 ('627 Broadway',),
 ('1 Infinite Loop',),
 ('541 Del Medio Avenue',),
 ('801 W 4th Street',),
 ('120 S Orange Ave',),
 ('69 Salem Street',),
 ('162 E Superior Street',),
 ('319 N. Frances Street',),
 ('2211 W Berry Street',),
 ('1033 N Park Ave',),
 ('302 S 700 E',),
 ('796 Dundas Street West',),
 ('230 Elgin Street',),
 ('194A Chain Lake Drive',),
 ('696 Osborne Street',),
 ('5112 48 Street',),
 ('Rua da Assunção 53',),
 ('Rua dos Campeões Europeus de Viena, 4350',),
 ('Tauentzienstraße 8',),
 ('Berger Straße 10',),
 ('Barbarossastraße 19',),
 ('4, Rue Milton',),
 ('8, Rue Hanovre',),
 ('11, Place Bellecour',),
 ('9, Place Louis Barthou',),
 ('68, Rue Jouvence',),
 ('Porthaninkatu 9',),
 ('Erzsébet krt. 58.',),
 ('3 Chatham Street',),
 ('Via Degli Scipioni, 43',),
 ('Lijnbaansgracht 120bg',),
 ('Ordynacka 10',),
 ('C/ San Bernardo 85',),
 ('Celsiusg. 9',),
 ('202 Hoxton Street',),
 ('113 Lupus St',),
 ('110 Raeburn Pl',),
 ('421 Bourke Street',),
 ('307 Macacha Güemes',),
 ('Calle Lira, 198',),
 ('12,Community Centre',),
 ('3,Raj Bhavan Road',)]

## Todo

- String manipulation
- Variables
- Aggregate function
- Case statements
- Pivot tables (https://mode.com/sql-tutorial/sql-pivot-table/)
- Subqueries (correlated and non-correlated)
- Windows (https://mode.com/sql-tutorial/sql-window-functions/)
- Views
- Profiling (https://mode.com/sql-tutorial/sql-performance-tuning/?)
- Functions and stored procedures
- Other? (https://stackoverflow.com/questions/2054130/what-is-advanced-sql)